#### UVGridlineType Enumeration

---

|  |
| --- |
| See Also |

A choice between U-gridlines or V-gridlines of a divided surface U Gridlines V Gridlines

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum UVGridlineType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration UVGridlineType ``` |

| Visual C++ |
| --- |
| ``` public enum class UVGridlineType ``` |

# Members

| Member name | Description |
| --- | --- |
| U |  |
| V |  |

# See Also

Autodesk.Revit.DB Namespace